# Pandas

In [1]:
import pandas as pd

### Series
One dimensional array

In [4]:
fruits = pd.Series(['apple', 'pear', 'orange', 'melon', 'kiwi'], index=[5, 6, 'sju', 8, 9])
fruits

5       apple
6        pear
sju    orange
8       melon
9        kiwi
dtype: object

In [3]:
fruits.apply(str.upper)

0     APPLE
1      PEAR
2    ORANGE
3     MELON
4      KIWI
dtype: object

In [5]:
numbers = pd.Series([5, 6, 3])

numbers[numbers >= 5]

0    5
1    6
dtype: int64

### DataFrame
Two dimensional data structure, consisting of series

# Seaborn

In [6]:
import seaborn as sns

In [10]:
tips = sns.load_dataset('tips')
tips.head(3)
#tips.tail()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3